---

C#Visual BasicVisual C++

Revit 2024 API
---
CopyPasteOptions..::..GetDuplicateTypeNamesHandler Method
CopyPasteOptions Class See Also Send Feedback
---

Returns current duplicate type names handler or nullNothingnullptra null reference (Nothing in Visual Basic) if none is set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014

# Syntax

C#
---

    public IDuplicateTypeNamesHandler GetDuplicateTypeNamesHandler()

Visual Basic
---

    Public Function GetDuplicateTypeNamesHandler As IDuplicateTypeNamesHandler

Visual C++
---

    public:
    IDuplicateTypeNamesHandler^ GetDuplicateTypeNamesHandler()

# See Also

CopyPasteOptions Class

Autodesk.Revit.DB Namespace